# CurveTo

## Description
Procedure CurveTo creates a bezier vertex point at the specified point. Parameter p specifies the coordinate location of the vertex.

```pascal
PROCEDURE CurveTo(pX,pY : REAL);
```

```python
def vs.CurveTo(p):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|p|REAL|Coordinate of vertex.|

## Version
Availability: from MiniCAD4.0

## Category
* Objects - Polys